# Дробная часть»
# Дано положительное действительное число X. Выведите его дробную часть.

x = float(input())
print(x % 1)  # или print(x - int(x))
