# Задача «Замена подстроки»
# Дана строка. Замените в этой строке все цифры 1 на слово one.

s = input()
print(input().replace('1', 'one'))
