# Задача «Удаление символа»
# Дана строка. Удалите из этой строки все символы @. 

print(input().replace('@',''))
