# Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

a = int(input())
b = int(input())
c = int(input())
sum = a + b + c
print(sum)
